pass_application_benchmarks/db_bench/linux_500/1757112509_db_bench_6.log
Set seed to 1757112509783559 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/test_disk_6]
fillseq      :      24.008 micros/op 666250 ops/sec 96.060 seconds 64000000 operations;  671.0 MB/s
Set seed to 1757112672443335 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/test_disk_6]
fillsync     :     167.317 micros/op 95589 ops/sec 50.046 seconds 4783872 operations;   96.3 MB/s (4000 ops)
Set seed to 1757112783489665 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_6]
overwrite    :      41.680 micros/op 383793 ops/sec 50.029 seconds 19200800 operations;  386.5 MB/s
Set seed to 1757112901624436 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_6]
readrandom   :       1.787 micros/op 8950181 ops/sec 50.012 seconds 447617984 operations; (0 of 26384999 found)

Set seed to 1757113015160047 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_6]
seekrandom   :  151341.893 micros/op 105 ops/sec 2582.123 seconds 272984 operations; (0 of 30999 found)